УНФ_ТЕСТ/src/AccumulationRegisters/ДенежныеСредстваВРезерве/ДенежныеСредстваВРезерве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваВРезерве</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПеремещениеДСПлан</types>
      <types>DocumentRef.РасходДСПлан</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ/src/AccumulationRegisters/ДенежныеСредстваВРезерве/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ДенежныеСредстваВРезерве.НомерСтроки КАК НомерСтроки,
	|	ДенежныеСредстваВРезерве.Организация КАК Организация,
	|	ДенежныеСредстваВРезерве.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДенежныеСредстваВРезерве.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредстваВРезерве.Валюта КАК Валюта,
	|	ДенежныеСредстваВРезерве.Документ КАК Документ,
	|	ДенежныеСредстваВРезерве.Сумма КАК СуммаПередЗаписью,
	|	ДенежныеСредстваВРезерве.Сумма КАК СуммаИзменение,
	|	ДенежныеСредстваВРезерве.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияДенежныеСредстваВРезервеИзменение
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВРезерве КАК ДенежныеСредстваВРезерве");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияДенежныеСредстваВРезервеИзменение", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") И ПолучитьФункциональнуюОпцию("ИспользоватьРезервированиеДенежныхСредств"));
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(БанковскийСчетКасса)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
